{
  "firstName": "Naz",
  "lastName": "Ferbei",
  "githubId": "nferbei",
  "title": "Web App and Mobile App developer with AI experience",

  "skills": ["Golang", "TypeScript", "MySQL", "React", "PostgreSQL", "Next.js", "GraphQL", "Node.js", "JavaScript", "Docker", "Redis", "Solidity", "Rust", "NestJS"],

  "email": "n@codeandcakes.com",
  "description": "📣 Specializing in Full Stack Software Engineering with a strong focus on AI, Blockchain, HealthTech, Web & Mobile App Development, and MVPs for startups! Experienced in developing AI-powered chatbots, computer vision tasks, voice recognition solutions, and secure, scalable blockchain applications.\n\n📣 I’ve helped early-stage startups develop their MVPs, worked with innovative companies in healthcare and blockchain, and built robust web and mobile applications tailored to specific industries like FinTech, EdTech, and HealthTech.\n\nLooking for someone who’s as invested in your success as you are? With extensive experience across AI, blockchain, and app development, I bring both technical expertise and business insight to each project.\n\nMy clients are more than satisfied with the results. Here are a few highlights:\n✅ “Nazarii is an A player. Relaxed, professional, competent - couldn't more highly recommend.”\n✅ “Working with Nazari was very pleasant, he actively performed the tasks he was thinking about. He is a professional with a great approach to work. It was an honor to work with Nazari.”\n\nIf you’re looking for a developer who:\n🔥 “Understands both technical depth and the unique needs of startups and high-growth industries.”\n🔥 “Is committed to delivering reliable, scalable solutions in health tech, blockchain, and AI.”\n🔥 “Can support every stage of product development, from MVP to a fully scalable application.”\n\nBy working with me, you will:\n⭐ Gain a technical partner skilled in AI-driven solutions like NLP chatbots and computer vision, as well as blockchain applications, from smart contracts to DeFi.\n⭐ Experience efficient, agile development, fast prototyping, and seamless integration for healthcare, finance, and blockchain projects.\n⭐ Benefit from a deep stack of technologies, including Python, Node.js, React, TensorFlow, Solidity, AWS, Firebase, Docker, and more.\n\nLet’s create impactful and innovative solutions that drive your business forward!"
}
