{
  "firstName": "Vadym",
  "lastName": "Shashkov",
  "githubId": "vshashkov",
  "title": "Expert-Vetted | React & Node.js Full Stack Pro",

  "skills": ["LoopBack", "PostgreSQL", "PDF Conversion", "Node.js", "Business with 1-9 Employees", "JavaScript", "TypeScript", "Angular", "Amazon Web Services", "MySQL", "AWS Lambda", "ExpressJS", "GraphQL", "Web Development", "React"],

  "email": "v@codeandcakes.com",
  "description": "🌟 Unlock Excellence with an Upwork Expert-Vetted Developer! 🌟\n\nAre you seeking a top-tier developer who can elevate user experiences, maximize ROI, and accelerate your product launch? Do you value transparent communication and unwavering commitment to success? Look no further - I’m here to turn your vision into reality.\n\n🔥 Upwork Expert-Vetted: Proud to be among the top 1% of freelancers recognized for exceptional skills and professionalism.\n\n🔥 Seasoned Software Engineer with a Master's degree in Computer Science and over 10 years of experience in web and mobile application development.\n\n🔥 CTO of Code & Cakes, a globally recognized agency boasting a flawless 5-star rating on Clutch.\n\n🔥 Former Founding Engineer at a Y Combinator-backed company that successfully exited.\n\n\n🚀 What I Bring to the Table:\n\n- Full Stack Mastery: Proficient in modern technologies, including JavaScript, TypeScript, ReactJS, NextJs, Node.js, NestJs, Golang, Rust, Python, and more.\n- Rapid Adaptor: Quick to embrace new technologies, staying ahead of industry trends and best practices.\n- Reliability & Precision: Committed to delivering high-quality work - on time, every time.\n- Strategic Problem Solver: Driven by curiosity, constantly asking \"Why?\" and \"What's the purpose?\" to ensure optimal outcomes.\n\n🔧 Technical Proficiencies:\n\n- Languages: JavaScript, TypeScript, Golang, Rust, Python, Solidity, Bash, HTML5, CSS3, SQL;\n- Frontend: ReactJS, NextJS, Vue3, NuxtJS, Angular, Svelte, Tailwind, Mantine, Sass, Web3.js\n- Backend: Node.js, Express, NestJS, Loopback, Django, GraphQL, gRPC, REST API\n- Databases: PostgreSQL, MySQL, Redis, Clickhouse, MongoDB, Firestore, Apache Cassandra\n- Mobile: React Native, Flutter, Android, iOS Development\n- Infrastructure & DevOps: AWS, Azure, GCP, Firebase, Docker, Kubernetes, Terraform, Jenkins, Git\n- AI/ML: OpenAI GPT-4/GPT-o, Anthropic, AWS Bedrock, TensorFlow, PyTorch, Machine Learning, Data Science\n- Blockchain: Ethereum, Solidity, Web3.js, NFTs, DeFi, Cryptocurrency\n- Cybersecurity: Ethical Hacking, Penetration Testing, Secure Code Review\n\n📣 Keywords: Senior Software Engineer, Full Stack Developer, AI Developer, AI Engineer, AI App Developer, AI Agent Developer, AI Bot Developer, Machine Learning Engineer, Data Scientist, Software Engineer, Backend Developer, Frontend Developer, DevOps Engineer, Cloud Engineer, Mobile Developer, Web Developer, Blockchain Developer, Cybersecurity Engineer, Ethical Hacker, Penetration Tester, Natural Language Processing Engineer, Computer Vision Engineer, Deep Learning Engineer, Reinforcement Learning Specialist, Predictive Analytics Specialist, AI Model Integration Specialist, API Integration Specialist, Cloud Infrastructure Engineer, Site Reliability Engineer, Android Developer, iOS Developer, AI Researcher, Automation Engineer, JavaScript, TypeScript, Python, Golang, Rust, ReactJS, NextJS, Vue3, Angular, Svelte, Node.js, NestJS, NX/JS, Express, Loopback, Django, GraphQL, gRPC, REST API, PostgreSQL, MySQL, Redis, MongoDB, Firestore, Apache Cassandra, Docker, Kubernetes, Terraform, AWS, GCP, Azure, Firebase, Jenkins, Solidity, Ethereum, Web3.js, NFTs, DeFi, Blockchain, Blockchain Development, TensorFlow, PyTorch, OpenAI, GPT-4, AWS Bedrock, Anthropic, AI App Development, AI Development, AI Agent Development, AI Bot, AI Model Integration, AI-Generated Code, Natural Language Processing (NLP), Computer Vision, Neural Networks, Deep Learning, Reinforcement Learning, Supervised Learning, Unsupervised Learning, Ethical AI, Predictive Analytics, Cybersecurity, Ethical Hacking, Penetration Testing, React Native, Flutter, Android Development, iOS Development, API Integration, Web Development, Mobile Development, Stripe, Git, Chatbot Development, BigCommerce, Ecommerce Website, HTML5, OpenAI API, LLM Prompt Engineering, Model Training, Java, Android App Development, Smartphone, Shopify, Firebase Realtime Database, Database Architecture, Web Application, Prototyping, HIPAA, Compliance, Information Security, Shopify Apps, Shopify Templates, Shopify Plus, Shopify Theme, Full-Stack Development, Artificial Intelligence, Machine Learning.\n\n🎯 Ready to elevate your project to the next level? Let's collaborate to build something exceptional. Contact me today, and let's exceed your expectations together.\n\nLeverage the expertise of an Upwork Expert-Vetted professional to bring unparalleled value to your project."
}
